<a href="https://colab.research.google.com/github/fafa20252025/fariba/blob/main/panda_exercise_series.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [512]:
import pandas as pd

In [513]:
s=pd.Series([10,20,30,40,50]) #series is one dimentional which means only one column

print(s)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [514]:
s.dtype

dtype('int64')

In [515]:
s.values

array([10, 20, 30, 40, 50])

In [516]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [517]:
s.name='calories'  #assign name to the column
s

0    10
1    20
2    30
3    40
4    50
Name: calories, dtype: int64

# **Indexing**

In [518]:
s[2:4]

2    30
3    40
Name: calories, dtype: int64

# **iloc**
is a function used for location based indexing

In [519]:
s.iloc[3]

np.int64(40)

In [520]:
s.iloc[[1,3,4]]

1    20
3    40
4    50
Name: calories, dtype: int64

In [521]:
Index=['apple','banana','cherry','date','elderberry']  #index is the name of the variable
s.index=Index
s  #print s

apple         10
banana        20
cherry        30
date          40
elderberry    50
Name: calories, dtype: int64

In [522]:
s['banana']

np.int64(20)

# **loc**
is a function for label based indexing. note that start and stop index are both included in the output unlike numerical indexing.

In [523]:
s.loc['banana']

np.int64(20)

In [524]:
s.loc['apple':'cherry']

apple     10
banana    20
cherry    30
Name: calories, dtype: int64

In [525]:
s.loc[['apple','cherry','elderberry']]  #multiple indexing

apple         10
cherry        30
elderberry    50
Name: calories, dtype: int64

# **Dictionary**

In [526]:
fruit_dict={'apple':10,'banana':20,'cherry':30,'date':40,'elderberry':50}

In [527]:
#create series of dictionary
s2=pd.Series(fruit_dict, name='protein')
s2

apple         10
banana        20
cherry        30
date          40
elderberry    50
Name: protein, dtype: int64

# **Conditional selection**
example: get all the fruit that have protein more than 20

In [528]:
s2[s2>20]

cherry        30
date          40
elderberry    50
Name: protein, dtype: int64

# **Logical operators**
AND, OR,NOT

In [529]:
#fruits with protein over 20 and less than 50
s2[(s2>20) & (s2<=50)]

cherry        30
date          40
elderberry    50
Name: protein, dtype: int64

# *Modifying the series*

In [530]:
#modify banana protein from 20 to 60
s2['banana']=60
s2

apple         10
banana        60
cherry        30
date          40
elderberry    50
Name: protein, dtype: int64